const firstGame = document.querySelector('.btn1');
const secondGame = document.querySelector('.btn2');

/* Вгадай число */

firstGame.addEventListener('click', Game1);
secondGame.addEventListener('click', Game2);

function Game1() {
    alert('Привіт. Давай зіграємо у гру! Ти маєш вгадати число від 0 до 10. Щоб продовжити натисни ОК.'); //привітання

let answer = confirm('Чи хочеш зіграти зі мною?'); // пропозиція гри
    if (answer) {
        myGame(); //якщо так переходимо у гру або виходимо
    } else alert('Можливо, в інший раз. До побачення!');

function myGame() { // пояснення що потрібно зробити
        const playersNum = prompt('Вгадай число від 0 до 10. Відповідь напиши у поле:');
        let result = correctAnswer(playersNum.trim()); //перевірка на правильну відповідь
        checkAnswer(result); // якщо значення коректне, порівнюємо з рандомним числом
    }

function correctAnswer(arg) { //перевірка чи корекно введене значення
    if (arg <= 0 || arg > 10 || isNaN(arg)) {
        let newVar = prompt('Ти ввів невірне значення! Введи ще раз');
        correctAnswer(newVar) //якщо значення невірне, пропонуємо ввести ще раз і перевіряємо знову
    } else return arg; //повертаємо коректне значення
}

function checkAnswer(arg) { //функція порівняння рандомного числа 3 відповіддю
    const randomNumber = Math.floor(Math.random() * 10) + 1; //генеруємо рандомне число
    if (arg === randomNumber) { //перевіряємо передане (перевірене коректне) значення чи вгадав число гравець
        let winner = confirm('Вітаю. Ти вгадав! Зіграємо ще?'); //якщо виграв пропонуємо зіграти ще раз або вихід з гри
        if (winner) {
            myGame();
        } else alert('Можливо, в інший раз. До побачення!');

    } else {
        let nextGame = confirm('Ти програв. Зіграємо ще?'); //якщо програв пропонуємо зіграти ще раз або вихід з гри
        if (nextGame) {
            myGame();
        } else alert('Можливо, в інший раз. До побачення!');
    }
}
}


/* Історія */

function Game2() {

        alert('У королівстві, де легенди оживають, молодий зброєносець Люк мріє стати рицарем. Він служить Сір Роберту, рицарю, який вважає, що честь — це найвища добродійність.'); //початок

        alert('Сір Роберт ставить перед Люком випробування, що визначить його долю.');

        Wood();
    
        function Wood() {

        let step1 = prompt('1. Вирушити в ліс, 2. Піти через село, 3. Відправитися до замку дракона');

        if (step1 === '1') {
            alert('Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку.')
            let potion = confirm('OK - Прийняти зілля, Відміна - Відмовитися');
            if (potion) {
                alert('Люк отримує надприродну силу, але залишається в боргу перед чарівницею.');
                Tournament();
            } else {
                alert('Люк oбирає чесний шлях, відмовляючись від легкого успіху.');
                Tournament();
            }
            return;
        }

        else if (step1 === '2') {
            alert('Люк допомагає селянам, які потерпають від голови розбійників.')
            let fight = confirm('OK - Допомогти силою, Відміна - Знайти мирне рішення');
            if (fight) {
                alert('Люк використовує силу для захисту селян, але отримує поранення.');
                Tournament();
            } else {
                alert('Люк вирішує конфлікти миром, заробляючи повагу як лідера.');
                Tournament();
            }
            return;
        }

        else {
            alert('Люк вирішує випробувати себе, викликаючи дракона на бій.')
            let dragon = confirm('OK - Бій з драконом, Відміна - Спроба перемовин');
            if (dragon) {
                alert('Люк гине, але його вчинок вважається героїчним.');
                Final4();
            } else {
                alert('Люк дізнається, що дракон не хоче воювати, і вони досягають миру.');
                LastTask();
            }
            return;
        }
    };

    function Tournament() {
        alert('Після повернення з подорожей Люка викликають на турнір.');

        let step2 = prompt('1. Боротьба за честь, 2. Допомога іншому учаснику, 3. Відмова від бою');

        if (step2 === '1') {
            alert('Люк демонструє свої навички, здобуваючи повагу.');
            LastTask();
            return;
        } 

        else if (step2 === '2') {
            alert('Люк допомагає пораненому рицарю, показуючи своє серце.');
            Final2();
            return;
        } 

        else {
            alert('Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати.');
            Final1();
            return;
        } 
    }

    function LastTask() {
        alert('Король, вражений діями Люка, пропонує йому останнє завдання.');

        let step3 = prompt('1. Захистити королівство, 2. Пошук зниклої реліквії');

        if (step3 === '1') {
            alert('Люк веде війська проти ворога, демонструючи свою відвагу.');
            Final1();
            return;
        } 

        else {
            alert('Люк вирушає за древньою реліквією, що може врятувати королівство.');
            Final3();
            return;
        } 
    }

    function Final1() {
        alert('Люк стає лицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству. Кінець історії.');
    }

    function Final2() {
        alert('Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті. Кінець історії.');
    }

    function Final3() {
        alert('Люк доводить, що можна знайти мир навіть із драконами, і врятувати королівство без насильства, стаючи легендою. Кінець історії.');
    }

    function Final4() {
        alert('Його ім`я вічно живе в легендах як символ непереможної сміливості та жертовності. Кінець історії.');
    }
}